src/InformationRegisters/DatareonЛогиОчередь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>DatareonЛогиОчередь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднееВремяОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднееВремяВОчереди</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСобытий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВОчереди</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСобытийВББазеЗаПериод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезмерОчередиВБазе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодЧтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IdТипа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/DatareonТипыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>DatareonТипыДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IdТипа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/DatareonЧтениеЛогов/Ext/Module.bsl
#Область Основное

/// регламентное задание
Процедура ЗаполнитьРегистрыОчередиDatareon() Экспорт 
	
	ДатаОтбора = ТекущаяДата() - 900;
	
	Результат = ПолучитьТаблицуФайлаЛога(ДатаОтбора);
	
	ЗаписатьВРегистр(Результат, ДатаОтбора);

КонецПроцедуры    

Процедура ЗаписатьВРегистр(Результат, ДатаОтбора)
	
	Набор = РегистрыСведений.DatareonЛогиОчередь.СоздатьНаборЗаписей();
	
	ТабДанных = Результат.Выгрузить();
	
	ТабДанных.Колонки.IdДанных.Имя = "IdТипа";  
	ТабДанных.Колонки.ОбъектСобытия.Имя = "ИмяТипа";  
	
	ТабДанных.Колонки.Добавить("ПериодЧтения");
	ТабДанных.ЗаполнитьЗначения(ДатаОтбора, "ПериодЧтения");
	
	Нашли = Новый  Массив;
	
	Для Каждого Стр из ТабДанных Цикл
		
		Если Нашли.Найти(Стр.IdТипа)  = Неопределено Тогда
			
			Если Не Стр.IdТипа = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
				Запись = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Стр); 
			КонецЕсли;  
			
			Нашли.Добавить(Стр.IdТипа);
			
		КонецЕсли;  
		
	КонецЦикла;
	
	Набор.Записать(РежимЗамещения.Слияние);
	
КонецПроцедуры

///*** Точка входа  
Функция ПолучитьТаблицуФайлаЛога(ДатаОтбора , ВыводНаФорму = Ложь, ПараметрыВызова = Неопределено)  Экспорт 
		
	ТаблицаОшибок  = Новый ТаблицаЗначений;	
	ТаблицаОшибок.Колонки.Добавить("ТекстОшибки", ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	
	Запрос = Новый Запрос;   
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ПараметрыВызова = Неопределено Тогда
		ПараметрыВызова = Новый Структура;   		
	КонецЕсли;  
	
	ПараметрыВызова.Вставить("ТаблицаОшибок", ТаблицаОшибок); 
	
	ПараметрыВызова.Вставить("Запрос", Запрос);
	
	/// типы данных из файла или из регистра	
	ТипыИзФайла = DatareonТипыДанных(ПараметрыВызова, ПараметрыВызова.Свойство("ПолучитьСписокФайловconfig") );
	
	/// пустая таблица
	Данные = СоздатьТаблицуДанныхЛога(); 
		
	ПараметрыВызова.Вставить("Данные", Данные); 
	
	ПараметрыВызова.Вставить("ТипыИзФайла", ТипыИзФайла);
		
	ПараметрыВызова.Вставить("ДатаОтбора", ДатаОтбора);

	/// чтение файлов логов 
	ИмяОбщейПапки  = "\\RU97SVIT0005850\Events";	
	
	НайденныеФайлы = НайтиФайлы(ИмяОбщейПапки, "*.log", Ложь);
	
	ИмяОбщейПапкиПроцессы  = "\\RU97SVIT0005850\Process_Events";
	
	НайденныеФайлыПроцессы = НайтиФайлы(ИмяОбщейПапкиПроцессы, "*.log", Ложь);
	
	
	ПрочитатьЛоги(НайденныеФайлы, ПараметрыВызова, Ложь);
	
	МаксДата = ПолучитьМаксДату(ПараметрыВызова.Данные);

	Если МаксДата>ДатаОтбора Тогда 
		ЗагрузитьИзАрхивовZip (МаксДата, ИмяОбщейПапки, ПараметрыВызова );	
	КонецЕсли;
	
	ПрочитатьЛоги(НайденныеФайлыПроцессы, ПараметрыВызова, Истина);
	
	Возврат ЗаполнитьИтоговуюТаблицу(ВыводНаФорму, ПараметрыВызова) ;
  
КонецФункции

///Читает указанный файл лога в таблицу значений Данные 
Процедура ЗаполнитьТаблицуДанных(ИмяФайла, ДатаОтбора, ПараметрыВызова)  Экспорт 
	
	Данные = ПараметрыВызова.Данные; 
	ТипыИзФайла = ПараметрыВызова.ТипыИзФайла;
	ТаблицаОшибок = ПараметрыВызова.ТаблицаОшибок;
	
	Попытка
		ПотокДанных = ФайловыеПотоки.ОткрытьДляЧтения(ИмяФайла);     
	Исключение 
		
		СтрОшибки = ТаблицаОшибок.Добавить();
		СтрОшибки.ТекстОшибки = "Не  найден файл " + ИмяФайла;
		Возврат;
	КонецПопытки; 
	
	Буфер = Новый БуферДвоичныхДанных(400);
	
	ПотокДанных.Перейти(-400, ПозицияВПотоке.Конец); 
	ПотокДанных.Прочитать(Буфер,0,400);    
	
	ОбщаяСтрока = ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер);    
	ПотокДанных.Перейти(-400, ПозицияВПотоке.Текущая);
	
	Cтрока1 = "";
	
	Пока Истина Цикл  
		
		ПотокДанных.Перейти(-400, ПозицияВПотоке.Текущая);
		
		Если ПотокДанных.ТекущаяПозиция()<= 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПотокДанных.Прочитать(Буфер, 0 ,400);    
		Cтрока1 = ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер);
		
		ПозицияИнфо = СтрНайти(Cтрока1, "INFO");
		
		Если ПозицияИнфо = 0 Тогда  
			
			ОбщаяСтрока = Cтрока1 + ОбщаяСтрока;     
			ПотокДанных.Перейти(-400, ПозицияВПотоке.Текущая);    
			
		Иначе   
			
			Добавить = Сред(Cтрока1, ПозицияИнфо, СтрДлина(Cтрока1) );
			
			РазмерСтроки = ПолучитьДвоичныеДанныеИзСтроки(Добавить).Размер(); 
			
			ОбщаяСтрока = Добавить + ОбщаяСтрока;   
			ПотокДанных.Перейти(-РазмерСтроки, ПозицияВПотоке.Текущая); 
			
			ПозицияПроценты = Стрнайти(Добавить, "%");    
			ПозицияИнфо = Стрнайти(Добавить, "INFO");  
			
			Инфо = Сред(Добавить, ПозицияИнфо, ПозицияПроценты - ПозицияИнфо);  
			
			Если Инфо = "INFO TriggerJob Create " 
				Или СокрЛП(Инфо) = СокрЛП("INFO NodeMessageProcessor DefineFunc")
				Или   СокрЛП(Инфо) = СокрЛП("NodeClusterDataProcessor Restore")Тогда   
				
				ОбщаяСтрока = ""; 
				Cтрока1 = "";     
				
				Продолжить;  
				
			КонецЕсли;             
			
			Если ПозицияПроценты  = 0 Тогда 
				ПозицияПроценты = Стрнайти(ОбщаяСтрока, "%");    
				Инфо = Лев(ОбщаяСтрока, ПозицияПроценты-1);  
			КонецЕсли;
			
			Инфо2 =  Сред(ОбщаяСтрока, СтрНайти( ОбщаяСтрока, "%" , НаправлениеПоиска.СКонца) + 1, СтрДлина(ОбщаяСтрока) );
			
			Строка_json = СтрЗаменить( СтрЗаменить( СтрЗаменить ( ОбщаяСтрока, Инфо+"%%", "") , Инфо2 , ""), "%%","") ;
			Строка_json = СтрЗаменить(Строка_json ,"Dt-Timeout","Timeout");
			
			СтруктураДанных = ПолучитьСтруктуруСтрокиДанных(Строка_json, ТаблицаОшибок) ;
			
			Если Не СтруктураДанных = Неопределено Тогда 
				
				Если  СтруктураДанных.IdДанных = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
					
					СтрокаТипа = ТипыИзФайла.Найти(СтруктураДанных.ТипДанных, "ИмяТипа");  
					
					Если Не СтрокаТипа = Неопределено Тогда       
						
						СтруктураДанных.IdДанных =СтрокаТипа.IdТипа;   
						
					Иначе   
						
						СтрокаТипа = ТипыИзФайла.Найти("НЕОПРЕДЕЛЕНО", "ИмяТипа"); 
						
						Если Не СтрокаТипа = Неопределено Тогда       
							СтруктураДанных.IdДанных =СтрокаТипа.IdТипа; 
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
					
				Если  ЗначениеЗаполнено(СтруктураДанных.IdДанных)  И СтруктураДанных.ДатаРегистрации = Дата(1,1,1)
					И Не ЗначениеЗаполнено(СтруктураДанных.ТипДанных)  Тогда
					
					Попытка
						
						СтрокаТипа = ТипыИзФайла.Найти(СтруктураДанных.IdДанных, "IdТипа");  
						
						Если Не СтрокаТипа = Неопределено Тогда
							
							СтруктураДанных.ТипДанных = СтрокаТипа.ИмяТипа;
							
							СтруктураДанных.ДатаРегистрации = СтруктураДанных.ДатаСобытия;
							
							СтруктураДанных.ДатаМс = СтруктураДанных.ДатаСобытияМС;  
							
							Если Не ЗначениеЗаполнено(СтруктураДанных.idСообщения) Тогда	
								СтруктураДанных.idСообщения = СтруктураДанных.id; 
							КонецЕсли;
							
						КонецЕсли;     
						
					Исключение
			 	
						СтрОшибки = ТаблицаОшибок.Добавить();
						СтрОшибки.ТекстОшибки = "не обработана " +  СтруктураДанных.id+ "\\\"  + ОписаниеОшибки();
						
						СтруктураДанных.ДатаРегистрации = СтруктураДанных.ДатаСобытия;
							
						СтруктураДанных.ДатаМс = СтруктураДанных.ДатаСобытияМС; 

					КонецПопытки;
					
				КонецЕсли; 
				
			КонецЕсли;    
			
			Если Не СтруктураДанных = Неопределено Тогда 
				
				Если Не СтруктураДанных.IdДанных = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда 
					Стр = Данные.Добавить(); 
				КонецЕсли;   
				
			Иначе 
				
				Стр = Данные.Добавить();  
				
				СтрокаТипа = ТипыИзФайла.Найти("НЕОПРЕДЕЛЕНО", "ИмяТипа"); 
				
				Если Не СтрокаТипа = Неопределено Тогда       
					Стр.IdДанных = СтрокаТипа.IdТипа;  
					Стр.ТипДанных = "НЕОПРЕДЕЛЕНО"; 
				КонецЕсли;
											
				Стр.Инфо = Строка_json;   

			КонецЕсли;
			
			Если Не СтруктураДанных = Неопределено Тогда 
				
				СтруктураДанных.Инфо2 = Инфо2;
				
				СтруктураДанных.Инфо = СтрЗаменить(Инфо, "INFO", "");
				
				Если СтруктураДанных.ДатаСобытия < ДатаОтбора  И Не  СтруктураДанных.ДатаСобытия  = Дата(1,1,1) Тогда  
					ПараметрыВызова.Вставить("МаксДата",  СтруктураДанных.ДатаСобытия);
					Прервать;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(Стр, СтруктураДанных);        
							
			КонецЕсли;
			
			ОбщаяСтрока = ""; 
			Cтрока1 = "";     
			
		КонецЕсли;  
			
	КонецЦикла;    
	
	ПараметрыВызова.Данные = Данные; 
	ПараметрыВызова.ТипыИзФайла = ТипыИзФайла;
	ПараметрыВызова.ТаблицаОшибок = ТаблицаОшибок;

КонецПроцедуры

/// парсит строку из файл лога 
Функция ПолучитьСтруктуруСтрокиДанных(ОбщаяСтрока, ТаблицаОшибок)   
	
	СтруктураДанных = Новый Структура("Инфо, Инфо2, ДатаСобытия, id , ДатаМс ,ТипДанных, IdДанных, idСообщения, ДатаРегистрации, ДатаСобытияМС , Разница ");   
	
	Попытка
		Текстjson = ДесереализацияJSON(ОбщаяСтрока); 	
	Исключение    
		Возврат   Неопределено;	
	КонецПопытки;
			
	ДатаСтрокой = Лев( СтрЗаменить(Текстjson.creationDate , "T" ," "), 19 );				
	СтруктураДанных.ДатаСобытия = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаСтрокой, ЧастиДаты.ДатаВремя) + 10800;
	
	Попытка   
		
		СтруктураДанных.ДатаСобытияМС  = ТекущаяУниверсальнаяДатаВМиллисекундах() -  
			((ТекущаяДата() - СтруктураДанных.ДатаСобытия)*1000 ) 
			   + Число(Сред(Текстjson.creationDate ,21,3) ); 	
	Исключение   
		
		СтрОшибки = ТаблицаОшибок.Добавить();
		СтрОшибки.ТекстОшибки = "не прочиталась дата" + ДатаСтрокой + "\\\"  + ОписаниеОшибки();

		СтруктураДанных.ДатаСобытияМС  =  0;
			
	КонецПопытки;
		
	OriginalSystemDataType = "";
	Текстjson.Свойство("OriginalSystemDataType", OriginalSystemDataType);      
	
	Если Не OriginalSystemDataType  = Неопределено Тогда  
		СтруктураДанных.ТипДанных = СтрЗаменить(OriginalSystemDataType, символ(65533), "");  
	Иначе 
		СтруктураДанных.ТипДанных = "";
	КонецЕсли;

	СтруктураДанных.id = Текстjson.Id;   
	
	СтруктураДанных.idСообщения = Текстjson.CustomFields.id;    
	
	Если  ЗначениеЗаполнено(Текстjson.SystemDataType) Тогда    
		СтруктураДанных.IdДанных = Новый УникальныйИдентификатор(Текстjson.SystemDataType);    
	Иначе 
		СтрОшибки = ТаблицаОшибок.Добавить();
		СтрОшибки.ТекстОшибки = "не обнаружен тип данных" + Текстjson + "\\\"  + ОписаниеОшибки();
	КонецЕсли;      
	
	Если СтруктураДанных.IdДанных = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда     	
		СтрОшибки = ТаблицаОшибок.Добавить();
		СтрОшибки.ТекстОшибки = "не обнаружен тип данных" + Текстjson + "\\\"  + ОписаниеОшибки();
	КонецЕсли;
	
	Попытка       
		
	    СтруктураДанных.ДатаМс = Число(Текстjson.CustomFields.Properties.Properties.creationDateMs.Value);
		СтруктураДанных.ДатаРегистрации = Дата(1,1,1) + СтруктураДанных.ДатаМс/1000+10800; 	
		
	Исключение          
		
		СтрОшибки = ТаблицаОшибок.Добавить();
		СтрОшибки.ТекстОшибки = "не найдено свойство дата регистрации " + Текстjson + "\\\"  + ОписаниеОшибки();

		СтруктураДанных.ДатаРегистрации = Дата(1,1,1); 
		
	КонецПопытки;
		
	Возврат СтруктураДанных;
	
КонецФункции

///Читает ответ метода  "/wserpwork/hs/query/query_data/Datareon_Ochered"
Функция ПолучитьТаблицуОчередиИзБазы()  Экспорт 
	
	НастройкаПрокси = Неопределено;
	Сервер = "1cws-prod01.office.local";
	Порт = Неопределено;
	ИспользоватьNTMLАутентификацию = Неопределено;
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	Таймаут = 30;
	
	АутентификацияПользователь = Неопределено;
	АутентификацияПароль = Неопределено;
	
	СоединениеHTTP = Новый HTTPСоединение(Сервер, Порт, АутентификацияПользователь, АутентификацияПароль, НастройкаПрокси,Таймаут, ЗащищенноеСоединение);
	НовыйЗапрос = Новый HTTPЗапрос;
	НовыйЗапрос.АдресРесурса = "/wserpwork/hs/query/query_data/Datareon_Ochered";
	
	
	//Аутентификация базовая
	АутентификацияПользователь = "apiquery_datareon";
	АутентификацияПароль = "datareon_1";
	НовыйЗапрос.Заголовки.Вставить("Authorization", "Basic "+СтрЗаменить(ПолучитьBase64СтрокуИзДвоичныхДанных(ПолучитьДвоичныеДанныеИзСтроки(АутентификацияПользователь + ":"+ АутентификацияПароль)),Символы.ВК + Символы.ПС,""));
	
	//Тело запроса
	//Без тела
	ВидЗапроса = "GET";
	
	НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ОтветHTTP = СоединениеHTTP.ВызватьHTTPМетод(ВидЗапроса, НовыйЗапрос);
	ОкончаниеВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Длительность = ОкончаниеВыполнения - НачалоВыполнения;
	
	мЗначение = Неопределено; 
	
	Если НЕ ОтветHTTP.КодСостояния = 200 Тогда				
		
		ТекстСообщения = ОтветHTTP.ПолучитьТелоКакСтроку("UTF-8"); 
		
		Возврат Новый Структура("ТекстСообщения,КодОшибки", ТекстСообщения, ОтветHTTP.КодСостояния);		 
		
	Иначе                                           		
		
		ТекстСообщения = ОтветHTTP.ПолучитьТелоКакСтроку("UTF-8"); 
		
		Возврат МассивВТаблицуЗначений( ДесереализацияJSON(ТекстСообщения) );
		
	КонецЕсли;
	
КонецФункции

/// собирает итоговую таблицу из базы ERP и из файлов логов 
Функция ЗаполнитьИтоговуюТаблицу(ВыводНаФорму = Ложь, ПараметрыВызова )

	Запрос = ПараметрыВызова.Запрос;   

	ТаблицаОчередьВБазе = ПолучитьТаблицуОчередиИзБазы();
   	
	Если Типзнч(ТаблицаОчередьВБазе) = Тип("Структура") Тогда
		Возврат ТаблицаОчередьВБазе;
	КонецЕсли;     
	
	Запрос.УстановитьПараметр("ТаблицаОчередьВБазе", ТаблицаОчередьВБазе);	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаОчередьВБазе.ИмяТипа КАК СТРОКА(200)) КАК ИмяТипа,
	|	ТаблицаОчередьВБазе.КоличествоСобытийВББазеЗаПериод КАК КоличествоСобытийВББазеЗаПериод,
	|	ТаблицаОчередьВБазе.РезмерОчередиВБазе КАК РезмерОчередиВБазе
	|ПОМЕСТИТЬ ИтогоОчередьБезId
	|ИЗ
	|	&ТаблицаОчередьВБазе КАК ТаблицаОчередьВБазе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогоОчередьБезId.ИмяТипа КАК ИмяТипа,
	|	ИтогоОчередьБезId.КоличествоСобытийВББазеЗаПериод КАК КоличествоСобытийВББазеЗаПериод,
	|	ИтогоОчередьБезId.РезмерОчередиВБазе КАК РезмерОчередиВБазе,
	|	DatareonТипыДанных.IdТипа КАК IdТипа
	|ПОМЕСТИТЬ ИтогоОчередь
	|ИЗ
	|	ИтогоОчередьБезId КАК ИтогоОчередьБезId
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.DatareonТипыДанных КАК DatareonТипыДанных
	|		ПО ИтогоОчередьБезId.ИмяТипа = DatareonТипыДанных.ИмяТипа";   
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Данные.Инфо КАК Инфо,
	|	Данные.Инфо2 КАК Инфо2,
	|	Данные.ДатаСобытия КАК ДатаСобытия,
	|	Данные.ТипДанных КАК ТипДанных,
	|	Данные.IdДанных КАК IdДанных,
	|	Данные.idСообщения КАК idСообщения,
	|	Данные.ДатаРегистрации КАК ДатаРегистрации,
	|	Данные.id КАК id,
	|	Данные.ДатаСобытияМС КАК ДатаСобытияМС,
	|	Данные.ДатаМс КАК ДатаМс
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.idСообщения КАК idСообщения,
	|	МАКСИМУМ(Данные.ДатаСобытияМС) КАК Макс,
	|	МАКСИМУМ(Данные.ДатаМс) КАК ДатаРегистрации,
	|	МИНИМУМ(Данные.ДатаСобытияМС) КАК Мин,
	|	(МИНИМУМ(Данные.ДатаСобытияМС) - МАКСИМУМ(Данные.ДатаМс)) / 1000 КАК ВремяВОчереди,
	|	(МАКСИМУМ(Данные.ДатаСобытияМС) - МИНИМУМ(Данные.ДатаСобытияМС)) / 1000 КАК ВремяОбработки,
	|	ВЫБОР
	|		КОГДА Данные.ТипДанных = """"
	|			ТОГДА ЕСТЬNULL(ВТ_ТипыИзФайл.ИмяТипа, Данные.ТипДанных)
	|		ИНАЧЕ Данные.ТипДанных
	|	КОНЕЦ КАК ОбъектСобытия,
	|	Данные.IdДанных КАК IdДанных
	|ПОМЕСТИТЬ ВТ_ГрупиировкаПоId
	|ИЗ
	|	ВТ_Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТипыИзФайл КАК ВТ_ТипыИзФайл
	|		ПО Данные.IdДанных = ВТ_ТипыИзФайл.IdТипа
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.idСообщения,
	|	Данные.IdДанных,
	|	ВЫБОР
	|		КОГДА Данные.ТипДанных = """"
	|			ТОГДА ЕСТЬNULL(ВТ_ТипыИзФайл.ИмяТипа, Данные.ТипДанных)
	|		ИНАЧЕ Данные.ТипДанных
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГрупиировкаПоId.IdДанных КАК IdДанных,
	|	МАКСИМУМ(ВТ_ГрупиировкаПоId.ОбъектСобытия) КАК ОбъектСобытия,
	|	СУММА(ВТ_ГрупиировкаПоId.ВремяОбработки) КАК ВремяОбработки,
	|	СУММА(ВТ_ГрупиировкаПоId.ВремяВОчереди) КАК ВремяВОчереди,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ГрупиировкаПоId.idСообщения) КАК КоличествоСобытий,
	|	ВЫБОР
	|		КОГДА НЕ КОЛИЧЕСТВО(ВТ_ГрупиировкаПоId.idСообщения) = 0
	|			ТОГДА СУММА(ВТ_ГрупиировкаПоId.ВремяОбработки) / КОЛИЧЕСТВО(ВТ_ГрупиировкаПоId.idСообщения)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СреднееВремяОбработки,
	|	ВЫБОР
	|		КОГДА НЕ КОЛИЧЕСТВО(ВТ_ГрупиировкаПоId.idСообщения) = 0
	|			ТОГДА СУММА(ВТ_ГрупиировкаПоId.ВремяВОчереди) / КОЛИЧЕСТВО(ВТ_ГрупиировкаПоId.idСообщения)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СреднееВремяВОчереди,
	|	СРЕДНЕЕ(ИтогоОчередь.РезмерОчередиВБазе) КАК РезмерОчередиВБазе,
	|	СРЕДНЕЕ(ИтогоОчередь.КоличествоСобытийВББазеЗаПериод) КАК КоличествоСобытийВББазеЗаПериод
	|ИЗ
	|	ВТ_ГрупиировкаПоId КАК ВТ_ГрупиировкаПоId
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоОчередь КАК ИтогоОчередь
	|		ПО ВТ_ГрупиировкаПоId.IdДанных = ИтогоОчередь.IdТипа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ГрупиировкаПоId.IdДанных";
	
	Запрос.УстановитьПараметр("Данные", ПараметрыВызова.Данные); 
	
	Если ВыводНаФорму Тогда 
		
		Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		
		Возврат Пакет;  
		
	Иначе 
		
		Возврат Запрос.Выполнить();
		
	КонецЕсли;
		
КонецФункции

#КонецОбласти

// пустая таблица
Функция СоздатьТаблицуДанныхЛога()    
	
	Данные = Новый ТаблицаЗначений;

	ОписаниеСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(200);
	
	Данные.Колонки.Добавить("ДатаСобытия", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя) );

	Данные.Колонки.Добавить("id", ОбщегоНазначения.ОписаниеТипаСтрока(36) );

	Данные.Колонки.Добавить("ДатаМс", ОбщегоНазначения.ОписаниеТипаЧисло(30,0));
	
	Данные.Колонки.Добавить("Мили", ОбщегоНазначения.ОписаниеТипаЧисло(4,0));
	
	Данные.Колонки.Добавить("Инфо", ОписаниеСтрока);
	
	Данные.Колонки.Добавить("Инфо2", ОписаниеСтрока);

	Данные.Колонки.Добавить("ТипДанных", ОписаниеСтрока); 	

	Данные.Колонки.Добавить("IdДанных", Новый ОписаниеТипов("УникальныйИдентификатор") );  
	
	Данные.Колонки.Добавить("idСообщения", ОбщегоНазначения.ОписаниеТипаСтрока(36) ); 
	
	Данные.Колонки.Добавить("ДатаРегистрации",  ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));  
	
	Данные.Колонки.Добавить("ДатаСобытияМС", ОбщегоНазначения.ОписаниеТипаЧисло(30,0));
	
    Возврат Данные;
	
КонецФункции

/// находит масиммальную обработнанную дату
Функция ПолучитьМаксДату(Данные, НомерНачальнойСтроки = 0) 
	
	СтрокаДанных = Данные.Получить(Данные.Количество()- НомерНачальнойСтроки -1);
	
	счеткчик = 0;  
	
	Пока СтрокаДанных.IdДанных = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Цикл
		
		СтрокаДанных = Данные.Получить(Данные.Количество()- НомерНачальнойСтроки -1- счеткчик);
		
		счеткчик = счеткчик + 1;
		
	КонецЦикла;     
	
	Возврат СтрокаДанных.ДатаСобытия;  
	
КонецФункции


#Область СборДанных

Процедура ОтсортироватьМассивФайлов(НайденныеФайлы) 
	
	ТаблицаСортировки = Новый ТаблицаЗначений;
	
	ТаблицаСортировки.Колонки.Добавить("Имя");         
	
	ТаблицаСортировки.Колонки.Добавить("ПолноеИмя");
	
	
	 
КонецПроцедуры

Процедура ПрочитатьЛоги(НайденныеФайлы, ПараметрыВызова, ЭтоПроцессы)
	
	Индекс = 0;
	
	///ОтсортироватьМассивФайлов(НайденныеФайлы);
	
	ИмяФайла = НайденныеФайлы.Получить(НайденныеФайлы.ВГраница()).ПолноеИмя;
	
	Если Не ЭтоПроцессы Тогда
		
		ЗаполнитьТаблицуДанных(ИмяФайла, ПараметрыВызова.ДатаОтбора, ПараметрыВызова ); 
		
		МаксДата = ПолучитьМаксДату(ПараметрыВызова.Данные);  
		
		НомерНачальнойСтроки = 0;
		
	Иначе	
		
		МаксДата = ТекущаяДата();
		
		НомерНачальнойСтроки  = ПараметрыВызова.Данные.Количество(); 
		
	КонецЕсли;
	
	Пока МаксДата  > ПараметрыВызова.ДатаОтбора Цикл   
		
		ИмяФайла = НайденныеФайлы.Получить(НайденныеФайлы.ВГраница()- Индекс).ПолноеИмя; 	
		
		ЗаполнитьТаблицуДанных(ИмяФайла, ПараметрыВызова.ДатаОтбора , ПараметрыВызова); 
		
		Если ПараметрыВызова.Свойство("МаксДата") Тогда
			МаксДата  = ПараметрыВызова.МаксДата;  
			Прервать;
		КонецЕсли;           
		
		МаксДата = ПолучитьМаксДату(ПараметрыВызова.Данные, НомерНачальнойСтроки);
		
		Индекс = Индекс +1;  
		
		Если Индекс = НайденныеФайлы.ВГраница() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;      
	
КонецПроцедуры

Процедура ЗагрузитьИзАрхивовZip (МаксДата, ИмяОбщейПапки, ПараметрыВызова )
	
	МассивИмён = новый Массив;
	
	НайденныеФайлыzip = НайтиФайлы(ИмяОбщейПапки, "*.zip", Ложь);  
	
	Для Каждого Файлzip Из НайденныеФайлыzip Цикл
		
		Архив = Новый ЧтениеZipФайла(Файлzip.ПолноеИмя, "");
		
		Для Каждого Элемент Из Архив.Элементы Цикл    
			
			ИмяФайлаzip = КаталогВременныхФайлов() +"\" + Элемент.Имя;     
			
			МассивИмён.Добавить(ИмяФайлаzip);          
			
			Архив.Извлечь(Элемент, КаталогВременныхФайлов(), РежимВосстановленияПутейФайловZIP.Восстанавливать, "");  
			
		КонецЦикла;    
		
	КонецЦикла;
	
	МаксДата = ПолучитьМаксДату(ПараметрыВызова.Данные);
	
	Для ИндексСКонца = 0 по  МассивИмён.ВГраница() Цикл
		
		ИмяФайлаzipИзвлекли =  МассивИмён.Получить( МассивИмён.ВГраница()  - ИндексСКонца);
		
		Файл = Новый Файл(ИмяФайлаzipИзвлекли);
		
		Если Файл.Существует() Тогда
			ЗаполнитьТаблицуДанных(ИмяФайлаzipИзвлекли, ПараметрыВызова.ДатаОтбора , ПараметрыВызова); 
		КонецЕсли; 
		
		МаксДата = ПолучитьМаксДату(ПараметрыВызова.Данные); 
		
		Если  МаксДата<ПараметрыВызова.ДатаОтбора Тогда 
			Прервать;
		КонецЕсли;       
		
		УдалитьФайлы(ИмяФайлаzipИзвлекли);
		
		ИндексСКонца = ИндексСКонца+1;
		
	КонецЦикла;    
			
КонецПроцедуры      

#КонецОбласти

#Область ТипыДанныхDatareon   

Функция  ПолучитьСписокФайловconfig(ПутьККаталогу, ТаблицаОшибок)  Экспорт 
	
    НашлиВПапке = ПолучитьСписокФайловРекурсия(ПутьККаталогу);
	
	ТипыИзФайла = Новый ТаблицаЗначений; 
    ТипыИзФайла.Колонки.Добавить("IdТипа", ОбщегоНазначения.ОписаниеТипаСтрока(36) );
	ТипыИзФайла.Колонки.Добавить("ИмяТипа", ОбщегоНазначения.ОписаниеТипаСтрока(200) );

	Для Каждого Нашли Из НашлиВПапке Цикл 
		ОбработатьФайл(Нашли, ТипыИзФайла , ТаблицаОшибок );
	КонецЦикла;
	
	Возврат ТипыИзФайла;
	
КонецФункции   

///чтение типа данных из config Datareon
Процедура ОбработатьФайл(Имя, ТипыИзФайла, ТаблицаОшибок)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьФайл(Имя);
	Ответ = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);
	
	Попытка 
		
		Стр = ТипыИзФайла.Добавить();
		
		Если Ответ.Свойство("OriginalName")  И Ответ.Свойство("OriginalBaseClass")  Тогда 
			Если ЗначениеЗаполнено(Ответ.OriginalName) Тогда
				Стр.ИмяТипа = Ответ.OriginalBaseClass +"."+ Ответ.OriginalName; 
			КонецЕсли;
		Иначе	
			Стр.ИмяТипа = Ответ.Name;
		КонецЕсли;
		
		Стр.IdТипа = Ответ.EntityId;     
		
	Исключение   
		
		СтрОшибки = ТаблицаОшибок.Добавить();
		СтрОшибки.ТекстОшибки = "Не прочиталсяфайл " + Имя;
		
	КонецПопытки;
	
КонецПроцедуры

Функция DatareonТипыДанных(ПараметрыВызова, ПолучатьИзфайлов = Ложь) 

	Запрос = ПараметрыВызова.Запрос;

	Если Не ПолучатьИзфайлов Тогда
		
		Запрос.текст =
		"ВЫБРАТЬ
		|	DatareonТипыДанных.IdТипа КАК IdТипа,
		|	DatareonТипыДанных.ИмяТипа КАК ИмяТипа
		|ПОМЕСТИТЬ ВТ_ТипыИзФайл
		|ИЗ
		|	РегистрСведений.DatareonТипыДанных КАК DatareonТипыДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТипыИзФайл.IdТипа КАК IdТипа,
		|	ВТ_ТипыИзФайл.ИмяТипа КАК ИмяТипа
		|ИЗ
		|	ВТ_ТипыИзФайл КАК ВТ_ТипыИзФайл";  
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	Иначе   
		
		ТипыИзФайла = ПолучитьСписокФайловconfig(ПараметрыВызова.ПутьККаталогу, ПараметрыВызова.ТаблицаОшибок); 
		
		Запрос.Текст = 	
		"ВЫБРАТЬ
		|	ТипыИзФайла.IdТипа КАК IdТипа,
		|	ТипыИзФайла.ИмяТипа КАК ИмяТипа
		|ПОМЕСТИТЬ ВТ_ТипыИзФайл
		|ИЗ
		|	&ТипыИзФайла КАК ТипыИзФайла";
		
		Запрос.УстановитьПараметр("ТипыИзФайла", ТипыИзФайла);    
		
		Запрос.Выполнить();
		
		Возврат ТипыИзФайла;  
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Служебные  

Функция ПолучитьСписокФайловРекурсия(ПутьККаталогу)  
	
	ИменаФайлов = Новый Массив;
	
	НайденныеФайлы = НайтиФайлы(ПутьККаталогу, "*.*", Ложь);
	
	Для Каждого ТекущийФайл Из НайденныеФайлы Цикл
		
		Если ТекущийФайл.ЭтоФайл() Тогда  
			
			ИменаФайлов.добавить( ТекущийФайл.ПолноеИмя);
			
		ИначеЕсли ТекущийФайл.ЭтоКаталог() Тогда
			
			ПутьККаталогу = ТекущийФайл.ПолноеИмя;
			
			НашлиВПапке = ПолучитьСписокФайловРекурсия(ПутьККаталогу);    
			
			Для каждого Нашли Из НашлиВПапке Цикл 
				ИменаФайлов.Добавить(Нашли);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;   
	
	Возврат ИменаФайлов;
	
КонецФункции

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач Чтение) Экспорт
	
	Результат = Новый Структура;

	ПоследнееИмяРеквизита = Неопределено;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта И ПоследнееИмяРеквизита<>Неопределено Тогда 
			
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);     
			
		ИначеЕсли Тип = ТипЗначенияJSON.КонецОбъекта Тогда 
			
			Возврат Результат;       
			
			ПоследнееИмяРеквизита = Неопределено;     
			
		ИначеЕсли Тип = ТипЗначенияJSON.ИмяСвойства Тогда   
			
			Результат.Вставить(СтрЗаменить(Чтение.ТекущееЗначение,"$",""), Неопределено); 
			
			ПоследнееИмяРеквизита = СтрЗаменить(Чтение.ТекущееЗначение,"$","");      
			
		ИначеЕсли Тип = ТипЗначенияJSON.Булево или Тип = ТипЗначенияJSON.Строка
			или Тип = ТипЗначенияJSON.Число или Тип = ТипЗначенияJSON.Null Тогда 
			
			Результат[ПоследнееИмяРеквизита] = Чтение.ТекущееЗначение;  
			
		ИначеЕсли Тип = ТипЗначенияJSON.НачалоМассива Тогда  
			
		///	Результат[ПоследнееИмяРеквизита] = ЗаполнитьМассивИзОтветаJSON(Чтение);  
		
		КонецЕсли;
	КонецЦикла;  
		
	Возврат Результат;
КонецФункции 

Функция ДесереализацияJSON(Строка_json) Экспорт
	
    ЧтениеJSON 			= Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку(Строка_json); 
	ДанныеЗагрузки		=	ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат ДанныеЗагрузки;
	
КонецФункции
	 	 
Функция МассивВТаблицуЗначений(МассивСтруктур) Экспорт
	Таблица = Новый ТаблицаЗначений;
	// Создадим колонки по первой структуре массива
	Если ТипЗнч(МассивСтруктур) = Тип("Массив")
		И МассивСтруктур.Количество() <> 0 Тогда
		ПерваяСтруктура = МассивСтруктур[0];
		Для Каждого Свойство Из ПерваяСтруктура Цикл 
			Таблица.Колонки.Добавить(Свойство.Ключ, ОписаниеТиповПоТипу(ТипЗнч(Свойство.Значение)));
		КонецЦикла;
		
		Для Каждого Структура Из МассивСтруктур Цикл 
			НоваяСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Структура);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Таблица;
КонецФункции     

// Возвращает описание типов по переданному типу
// 
// Параметры:
//	Тип - Тип - Тип значения
//
// Возвращаемое значение:
//	ОписаниеТипов - созданное на основании переданного типа описание типов.
//
Функция ОписаниеТиповПоТипу(Тип) Экспорт
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип);
	
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	
	Возврат ОписаниеТипов;
КонецФункции 

#КонецОбласти
